In [1]:
import pandas as pd

In [2]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('data_sample_example.tsv', header=0, sep='\t')

In [3]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [4]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [5]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null object
City        6 non-null object
Position    4 non-null object
dtypes: object(4)
memory usage: 320.0+ bytes

In [6]:
#заполнение пропущенных значений с помощью метода fillna
frame.fillna('разнорабочий')

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер

In [7]:
#заполнение пропущенных значений с помощью метода fillna (inplace)
frame.fillna('разнорабочий', inplace=True)

In [8]:
frame

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер

In [9]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [10]:
frame[['Position']]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [11]:
frame[['Name', 'Position']]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [12]:
frame[:3] #выбираем первые три записи

           Name       Birth       City      Position
0   Иванов А.А.  22.03.1980     Москва  разнорабочий
1  Сорокин И.В.  07.08.1965  Волгоград       инженер
2    Белов М.М.  13.02.1980     Ростов      менеджер

In [13]:
frame[-3:] #выбираем три послдение записи

              Name       Birth    City      Position
3  Мельникова Д.С.  15.04.1985  Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985  Москва       инженер
5     Костров С.О.  31.05.1985  Москва        стажер

In [14]:
frame.loc[[0,1,2], ["Name", "City"]] #работает на основе имен

           Name       City
0   Иванов А.А.     Москва
1  Сорокин И.В.  Волгоград
2    Белов М.М.     Ростов

In [15]:
frame.iloc[[1,3,5], [0,1]] #работает на основе позиций

              Name       Birth
1     Сорокин И.В.  07.08.1965
3  Мельникова Д.С.  15.04.1985
5     Костров С.О.  31.05.1985

In [16]:
#frame.ix[[0,1,2], [0,1]] #поддерживает и имена и позиции (пример с позициями)

In [17]:
frame.shape

(6, 4)

In [18]:
frame

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер

In [19]:
#frame['IsStudent'] = [False True]

In [20]:
frame

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер